<!-- terraform-plan-comment -->
### Terraform Plan

<details><summary>Show Plan</summary>

```terraform
random_id.suffix: Refreshing state... [id=SDmmTw]
data.archive_file.page_generator_zip: Reading...
data.archive_file.lambda_zip: Reading...
data.archive_file.page_generator_zip: Read complete after 0s [id=25d2360d8e846156f2f17e7a0556b4c280d0b899]
data.archive_file.lambda_zip: Read complete after 0s [id=5ecf306f8a9aa6ef4a1605e393d1e35b83fc2b99]
data.aws_cloudfront_origin_request_policy.cors_s3_origin: Reading...
data.aws_cloudfront_response_headers_policy.security: Reading...
aws_cloudfront_origin_access_control.site: Refreshing state... [id=E362GSXPUAZ3M6]
aws_s3_bucket_public_access_block.www_redirect: Refreshing state... [id=www-shitbrucesays.co.uk]
aws_s3_bucket_website_configuration.www_redirect: Refreshing state... [id=www-shitbrucesays.co.uk]
aws_route53_zone.main: Refreshing state... [id=Z02196392OCM77HDMQZC7]
aws_apigatewayv2_api.http_api: Refreshing state... [id=ijed2skzy9]
aws_dynamodb_table.quotes: Refreshing state... [id=bruce-quotes]
aws_s3_bucket.www_redirect: Refreshing state... [id=www-shitbrucesays.co.uk]
aws_s3_bucket.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_iam_role.page_generator_exec: Refreshing state... [id=bruce-quotes-page-generator-exec]
data.aws_cloudfront_response_headers_policy.security: Read complete after 0s [id=67f7725c-6f97-4210-82d7-5512b31e9d03]
data.aws_cloudfront_origin_request_policy.cors_s3_origin: Read complete after 0s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
aws_iam_role.lambda_exec: Refreshing state... [id=bruce-quotes-lambda-exec]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-east-2:628639830692:certificate/fcd00a28-eb73-45bf-b11f-8e658d04566a]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::628639830692:oidc-provider/token.actions.githubusercontent.com]
data.aws_cloudfront_cache_policy.caching_optimized: Reading...
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_acm_certificate.cf: Refreshing state... [id=arn:aws:acm:us-east-1:628639830692:certificate/50c4b402-2aa2-4e14-8950-392f25254474]
aws_iam_role.github_terraform_plan: Refreshing state... [id=bruce-quotes-github-terraform-plan]
aws_iam_role.github_terraform_apply: Refreshing state... [id=bruce-quotes-github-terraform-apply]
data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=bruce-quotes-lambda-exec/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.page_generator_basic: Refreshing state... [id=bruce-quotes-page-generator-exec/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_route53_record.api_validation["api.shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__bebc934a45fa942b0df090b700ce79c4.api.shitbrucesays.co.uk._CNAME]
aws_iam_role_policy.github_terraform_plan: Refreshing state... [id=bruce-quotes-github-terraform-plan:terraform-plan-permissions]
aws_route53_record.cf_validation["shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__d627e24d7f5c6061d4a1173b065ef389.shitbrucesays.co.uk._CNAME]
aws_route53_record.cf_validation["www.shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__7e712fa0335addbfc9c83b37781bae5a.www.shitbrucesays.co.uk._CNAME]
aws_iam_role_policy.github_terraform_apply: Refreshing state... [id=bruce-quotes-github-terraform-apply:terraform-apply-permissions]
aws_acm_certificate_validation.api: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_apigatewayv2_domain_name.api: Refreshing state... [id=api.shitbrucesays.co.uk]
aws_iam_policy.ddb_access: Refreshing state... [id=arn:aws:iam::628639830692:policy/bruce-quotes-ddb-access]
aws_lambda_function.api: Refreshing state... [id=bruce-quotes-api]
aws_acm_certificate_validation.cf: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_iam_role_policy_attachment.ddb_to_lambda: Refreshing state... [id=bruce-quotes-lambda-exec/arn:aws:iam::628639830692:policy/bruce-quotes-ddb-access]
aws_apigatewayv2_api_mapping.api: Refreshing state... [id=uwchwi]
aws_route53_record.api: Refreshing state... [id=Z02196392OCM77HDMQZC7_api_A]
aws_s3_bucket_ownership_controls.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_s3_bucket_versioning.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_s3_object.css: Refreshing state... [id=bruce-quotes-site-4839a64f/styles.css]
aws_s3_object.js: Refreshing state... [id=bruce-quotes-site-4839a64f/app.js]
aws_s3_object.index: Refreshing state... [id=bruce-quotes-site-4839a64f/index.html]
aws_iam_policy.page_generator_access: Refreshing state... [id=arn:aws:iam::628639830692:policy/bruce-quotes-page-generator-access]
aws_lambda_function.page_generator: Refreshing state... [id=bruce-quotes-page-generator]
aws_cloudfront_distribution.site: Refreshing state... [id=E2T928B9V6ESU6]
aws_s3_object.robots: Refreshing state... [id=bruce-quotes-site-4839a64f/robots.txt]
aws_s3_bucket_public_access_block.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_s3_object.favicon: Refreshing state... [id=bruce-quotes-site-4839a64f/favicon.svg]
aws_s3_bucket_lifecycle_configuration.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_iam_role_policy_attachment.page_generator_access: Refreshing state... [id=bruce-quotes-page-generator-exec/arn:aws:iam::628639830692:policy/bruce-quotes-page-generator-access]
aws_route53_record.apex_aaaa: Refreshing state... [id=Z02196392OCM77HDMQZC7_shitbrucesays.co.uk_AAAA]
aws_route53_record.apex_a: Refreshing state... [id=Z02196392OCM77HDMQZC7_shitbrucesays.co.uk_A]
aws_route53_record.www_a: Refreshing state... [id=Z02196392OCM77HDMQZC7_www.shitbrucesays.co.uk_A]
aws_s3_bucket_policy.site_cf: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=01j05f6]
aws_lambda_permission.api_invoke: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_event_source_mapping.dynamodb_stream: Refreshing state... [id=2c115c0d-9b51-4a45-8fd2-6603a51c9ea2]
aws_apigatewayv2_route.options_quotes: Refreshing state... [id=ywezhrh]
aws_apigatewayv2_route.post_quotes: Refreshing state... [id=elwndgu]
aws_apigatewayv2_route.get_quotes: Refreshing state... [id=urzvk7b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site_allow_cf will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site_allow_cf" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::bruce-quotes-site-4839a64f/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::628639830692:distribution/E2T928B9V6ESU6",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.site will be updated in-place
  ~ resource "aws_cloudfront_distribution" "site" {
      ~ aliases                         = [
          + "www.shitbrucesays.co.uk",
            # (1 unchanged element hidden)
        ]
        id                              = "E2T928B9V6ESU6"
        tags                            = {}
        # (23 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_function.www_redirect will be created
  + resource "aws_cloudfront_function" "www_redirect" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var host = request.headers.host.value;
            
              if (host.startsWith('www.')) {
                return {
                  statusCode: 301,
                  statusDescription: 'Moved Permanently',
                  headers: {
                    location: { value: 'https://' + host.substring(4) + request.uri }
                  }
                };
              }
            
              return request;
            }
        EOT
      + comment         = "Redirect www subdomain to apex domain"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "bruce-quotes-www-redirect"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # aws_route53_record.www_a will be updated in-place
  ~ resource "aws_route53_record" "www_a" {
        id                               = "Z02196392OCM77HDMQZC7_www.shitbrucesays.co.uk_A"
        name                             = "www.shitbrucesays.co.uk"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "s3-website.us-east-2.amazonaws.com" -> "d30bw7rbomdu5l.cloudfront.net"
          ~ zone_id                = "Z2O1EMRO9K5GLX" -> "Z2FDTNDATAQYW2"
            # (1 unchanged attribute hidden)
        }
    }

  # aws_route53_record.www_aaaa will be created
  + resource "aws_route53_record" "www_aaaa" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.shitbrucesays.co.uk"
      + type            = "AAAA"
      + zone_id         = "Z02196392OCM77HDMQZC7"

      + alias {
          + evaluate_target_health = false
          + name                   = "d30bw7rbomdu5l.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_s3_bucket.www_redirect will be destroyed
  # (because aws_s3_bucket.www_redirect is not in configuration)
  - resource "aws_s3_bucket" "www_redirect" {
      - arn                         = "arn:aws:s3:::www-shitbrucesays.co.uk" -> null
      - bucket                      = "www-shitbrucesays.co.uk" -> null
      - bucket_domain_name          = "www-shitbrucesays.co.uk.s3.amazonaws.com" -> null
      - bucket_region               = "us-east-2" -> null
      - bucket_regional_domain_name = "www-shitbrucesays.co.uk.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "www-shitbrucesays.co.uk" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "environment" = "prod"
          - "system"      = "shit-bruce-says"
        } -> null
      - website_domain              = "s3-website.us-east-2.amazonaws.com" -> null
      - website_endpoint            = "www-shitbrucesays.co.uk.s3-website.us-east-2.amazonaws.com" -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "19c92888f4f8f22d108591c62b88f3de33d31e2da5d57039ec8f1128ab4016ed" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - redirect_all_requests_to = "https://shitbrucesays.co.uk" -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_s3_bucket_policy.site_cf will be updated in-place
  ~ resource "aws_s3_bucket_policy" "site_cf" {
        id     = "bruce-quotes-site-4839a64f"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::628639830692:distribution/E2T928B9V6ESU6"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::bruce-quotes-site-4839a64f/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.www_redirect will be destroyed
  # (because aws_s3_bucket_public_access_block.www_redirect is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "www_redirect" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "www-shitbrucesays.co.uk" -> null
      - id                      = "www-shitbrucesays.co.uk" -> null
      - ignore_public_acls      = false -> null
      - region                  = "us-east-2" -> null
      - restrict_public_buckets = false -> null
    }

  # aws_s3_bucket_website_configuration.www_redirect will be destroyed
  # (because aws_s3_bucket_website_configuration.www_redirect is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "www_redirect" {
      - bucket                = "www-shitbrucesays.co.uk" -> null
      - id                    = "www-shitbrucesays.co.uk" -> null
      - region                = "us-east-2" -> null
      - website_domain        = "s3-website.us-east-2.amazonaws.com" -> null
      - website_endpoint      = "www-shitbrucesays.co.uk.s3-website.us-east-2.amazonaws.com" -> null
        # (2 unchanged attributes hidden)

      - redirect_all_requests_to {
          - host_name = "shitbrucesays.co.uk" -> null
          - protocol  = "https" -> null
        }
    }

Plan: 2 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Plan: 2 to add, 3 to change, 3 to destroy.**

*Pusher: @thekbb, Action: `pull_request`*